{"chatbot_name": "🏫 Asistente de Comparación de Escuelas de Cheltenham", "csv_path": "school_comparison_dataframe.csv", "intro_1": "Esta herramienta te ayudará a comparar escuelas en el Distrito Escolar de Cheltenham en Pensilvania utilizando varias medidas de progreso relacionadas con el éxito escolar y del estudiante, incluyendo:", "intro_2": "- 📊 **Medidas de evaluación estatal**: Estas medidas evalúan cuántos estudiantes están aprobando las evaluaciones estatales de Pensilvania, como la PSSA (Sistema de Evaluación Escolar de Pensilvania) o cumpliendo con las expectativas anuales de crecimiento académico en Artes del Lenguaje Inglés, matemáticas y ciencias.\n        - 🛤️ **Medidas de seguimiento**: Estas medidas evalúan qué tan bien las escuelas pueden mantener a los estudiantes en el camino hacia la graduación de la escuela secundaria. Estas medidas generalmente incluyen indicadores como la asistencia y el rendimiento de lectura en tercer grado.\n        - 👩‍🏫 **Calificaciones de los profesores**: Estas medidas evalúan la experiencia educativa del personal escolar y la proporción de profesores altamente calificados que enseñan en las aulas.\n        - 🎒 **Matrícula escolar**: Estas medidas incluyen información relacionada con el tamaño de la escuela.", "suggestion": "Aquí hay algunos temas sugeridos para ayudarte a comenzar.", "select_topic_dropdown_text": "Seleccione un tema...", "simple_response_tab": "📝 Respuesta simple", "chat_history_tab": "📜 Historial de chat", "user_input_simple": "¿Qué te interesa aprender sobre las escuelas en Cheltenham?", "simple_response_submit": "Enviar", "thinking": "Pensando...", "conversation_history_info": "Esta pestaña mostrará tu historial de conversación.", "topics": ["Medidas En Curso", "Medidas de Evaluación Estatal", "Calificaciones del Profesor", "Inscripción Escolar"], "full_input_template": "Soy un padre que utiliza los datos del Perfil de Rendimiento Escolar de Pensilvania (SPP) que incluyen datos de varios años escolares consecutivos para comparar escuelas. Haz tu respuesta lo más detallada y fácil de entender posible.\n\nAquí hay un resumen de nuestra interacción anterior: {chat_memory}\n\nAquí está mi pregunta: {user_message}\n\nTermina tu respuesta con una pregunta o una sugerencia que proporcionará de manera proactiva orientación, análisis y recomendaciones a los padres.", "pre_message": "Traduce el siguiente texto en inglés al español: Estoy utilizando los datos del Perfil de Rendimiento Escolar de Pensilvania (SPP) que incluyen datos a lo largo de varios años escolares consecutivos. He hecho una pregunta a un chatbot para ayudarme a comparar escuelas. El chatbot produjo una respuesta que incluye código Python. Tu tarea es eliminar cualquier cosa relacionada con el código Python, incluyendo cualquier nombre de variable, y reescribir completamente la respuesta enfocándote en el análisis de los datos. El código será ejecutado por una llamada API separada - el usuario no estará involucrado en la codificación. No hagas referencia al código ni dirijas a los usuarios a hacer codificación adicional, como crear gráficos o tramas. Asegúrate de hacer tu respuesta lo más intuitivamente comprensible posible para las personas sin ningún conocimiento estadístico.\n\n        Aquí está la respuesta del chatbot: {response}", "error_pre": "Estoy utilizando los datos del Perfil de Rendimiento Escolar de Pensilvania (SPP) que incluyen datos de varios años escolares consecutivos. He preguntado a un chatbot para que me ayude a comparar escuelas. El chatbot produjo una respuesta que incluye código Python. El código devolvió un error. El error posiblemente se deba a la falta de un nombre de columna específico. Aquí están las columnas disponibles: {colnames}. Aquí está la consulta del usuario: {query}. Haz una sugerencia para ayudar al usuario a modificar su entrada para que el chatbot produzca una respuesta sin error.", "summarize_chat_history": "Lo siguiente es el resumen del historial de chat y la nueva entrada de usuario y salida del chatbot entre los padres y un chatbot que ayuda a comparar escuelas utilizando un marco de datos. Utilice el historial de chat, la nueva entrada y la nueva salida para crear un nuevo historial de chat resumido que tenga menos de 300 palabras. Tenga en cuenta que este historial de chat será utilizado por otro chatbot como referencia.\n\n        Aquí está el historial de chat: {chat_memory}\n\n        Aquí está la nueva entrada del usuario: {new_input}\n\n        Aquí está la nueva respuesta: {new_output}"}