{"chatbot_name": "🏫 Cheltenham School Comparison Assistant", "csv_path": "school_comparison_dataframe.csv", "intro_1": "This tool will help you compare schools in Pennsylvania’s Cheltenham School District using various progress measures related to school and student success, including:", "intro_2": "- 📊 **State assessment measures**: These measures assess how many students are passing Pennsylvania’s statewide assessments like the PSSA (Pennsylvania System of School Assessment) or meeting annual academic growth expectations in English Language Arts, mathematics, and science.\n        - 🛤️ **On-track measures**: These measures assess how well schools can keep students on track for high school graduation. These measures typically include indicators like attendance and third-grade reading performance.\n        - 👩‍🏫 **Teacher qualifications**: These measures assess the educational experience of school staff and the share of highly qualified teachers teaching in classrooms.\n        - 🎒 **School enrollment**: These measures include information related to school size.\n        \n        ", "topics": ["On-Track Measures", "State Assessment Measures", "Teacher Qualifications", "School Enrollment"], "suggestion": "Here are some suggested topics to help you get started", "select_topic_dropdown_text": "Select a topic...", "simple_response_tab": "📝 Simple response", "chat_history_tab": "📜 Chat history", "user_input_simple": "What are you interested in learning about the schools in Cheltenham?", "simple_response_submit": "Submit", "thinking": "Thinking...", "conversation_history_info": "This tab will show your conversation history.", "full_input_template": "I am a parent using the Pennsylvania School Performance Profile (SPP) data that includes data across multiple consecutive school years to compare schools. Make your response as detailed and as easy to understand as possible.\n\n    Here is a summary of our previous interaction: {chat_memory}\n\n    Here is my question: {user_message}\n\n    End your response with a question or a suggestion that will proactively provide guidance, analysis, and recommendations to parents.", "pre_message": "I am using the Pennsylvania School Performance Profile (SPP) data that includes data across multiple consecutive school years. I have asked a chat bot a question to help me compare schools. The chatbot produced a response that includes Python code. Your task is to remove anything related to Python code including any variable names, and completely rewrite the response focusing on the analysis of the data. The code will be run by a separate API call - the user will not be involved in coding. Do not reference the code or direct the users to do additional coding such as creating charts or plots. Make sure to make your response as intuitively understandable as possible to people without any statistical knowledge.\n\n        Here is the chat bot's response: {response}", "error_pre": "I am using the Pennsylvania School Performance Profile (SPP) data that includes data across multiple consecutive school years. I have asked a chat bot a question to help me compare schools. The chatbot produced a response that includes Python code. The code returned an error. The error is possibly due to the lack of specific column name. Here are the available columns: {colnames}. Here is the user's query: {query}. Make a suggestion to help the user modify their input so that the chatbot will produce a response without an error. ", "summarize_chat_history": "The following is the summarized chat history and the new user input and chatbot output between parents and a chatbot that helps compare schools using a data frame. Use the chat history, new input, and the new output to create a new, summarized chat history that is less than 300 words. Keep in mind that this chat history will be used by another chatbot as a reference.\n\n        Here is the chat history: {chat_memory}\n\n        Here is the new user input: {new_input}\n\n        Here is the new response: {new_output}"}